app/controllers/songs_controller.rb

SELECT  "songs".* FROM "songs" LIMIT ?  [["LIMIT", 3]]
---
  def song_html
    @songs = Song.all.limit(3)

SELECT  "songs".* FROM "songs" LIMIT ?  [["LIMIT", 3]]
---
  def song_json
    @songs = Song.all.limit(3)